{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "size_of_axes" : 1,
      "bottom" : "poses",
      "axes_0" : 0,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "x.2",
      "top" : "x.2",
      "type" : "expand_dims",
      "name" : "x.2"
    },
    {
      "axis_h" : 0,
      "axis_w" : 1,
      "bottom" : "x.2",
      "axis_k" : 2,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "x.3",
      "top" : "x.3",
      "type" : "transpose",
      "name" : "x.3"
    },
    {
      "name" : "104",
      "weights" : {

      },
      "dst_w" : -1,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 3,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "x.3",
      "debug_info" : "104",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "104"
    },
    {
      "size_of_axes" : 1,
      "bottom" : "104",
      "axes_0" : -1,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "x.4",
      "top" : "x.4",
      "type" : "expand_dims",
      "name" : "x.4"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "x.4",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "input.1",
      "top" : "input.1",
      "type" : "transpose",
      "name" : "input.1"
    },
    {
      "name" : "x.5",
      "bottom" : "input.1",
      "weights" : {

      },
      "debug_info" : "x.5",
      "top" : "x.5",
      "C" : 63,
      "blob_batchnorm_params" : 1,
      "type" : "batchnorm"
    },
    {
      "axis_h" : 1,
      "axis_w" : 2,
      "bottom" : "x.5",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "125",
      "top" : "125",
      "type" : "transpose",
      "name" : "125"
    },
    {
      "size_of_axes" : 1,
      "bottom" : "125",
      "axes_0" : 1,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "x.6",
      "version" : 1,
      "top" : "x.6",
      "type" : "squeeze",
      "name" : "x.6"
    },
    {
      "nB" : 63,
      "top" : "x.7",
      "has_biases" : 0,
      "weights" : {

      },
      "nC" : 704,
      "blob_weights" : 3,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "x.6",
      "debug_info" : "x.7",
      "has_tanh" : 0,
      "name" : "x.7",
      "has_prelu" : 0
    },
    {
      "name" : "145",
      "weights" : {

      },
      "dst_w" : 16,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 44,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "x.7",
      "debug_info" : "145",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "145"
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "145",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "input.2",
      "top" : "input.2",
      "type" : "transpose",
      "name" : "input.2"
    },
    {
      "name" : "input.3",
      "bottom" : "input.2",
      "weights" : {

      },
      "debug_info" : "input.3",
      "top" : "input.3",
      "C" : 16,
      "blob_batchnorm_params" : 5,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.3",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.4",
      "top" : "input.4",
      "type" : "activation",
      "name" : "input.4"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.5",
      "blob_weights" : 7,
      "K" : 16,
      "name" : "input.5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "input.4",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "debug_info" : "input.6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "size_x" : 3,
      "top" : "input.6",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 0,
      "type" : "pool",
      "name" : "input.6",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.5",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.7",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 0,
      "top" : "input.8",
      "blob_weights" : 11,
      "K" : 32,
      "blob_biases" : 9,
      "name" : "input.7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "input.6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.9",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "residual.1",
      "blob_weights" : 15,
      "K" : 16,
      "blob_biases" : 13,
      "name" : "input.9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "input.4",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "residual.1,input.8",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.10",
      "top" : "input.10",
      "type" : "elementwise",
      "name" : "input.10",
      "beta" : 0
    },
    {
      "bottom" : "input.10",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.11",
      "top" : "input.11",
      "type" : "activation",
      "name" : "input.11"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.12",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.12",
      "blob_weights" : 17,
      "K" : 8,
      "name" : "input.12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 16,
      "bottom" : "input.11",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "debug_info" : "input.13",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "size_x" : 3,
      "top" : "input.13",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 0,
      "type" : "pool",
      "name" : "input.13",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.12",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.14",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 0,
      "top" : "input.15",
      "blob_weights" : 21,
      "K" : 16,
      "blob_biases" : 19,
      "name" : "input.14",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input.13",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.16",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "residual.2",
      "blob_weights" : 25,
      "K" : 8,
      "blob_biases" : 23,
      "name" : "input.16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input.11",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.15,residual.2",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.17",
      "top" : "input.17",
      "type" : "elementwise",
      "name" : "input.17",
      "beta" : 0
    },
    {
      "bottom" : "input.17",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.18",
      "top" : "input.18",
      "type" : "activation",
      "name" : "input.18"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.19",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.19",
      "blob_weights" : 27,
      "K" : 16,
      "name" : "input.19",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "input.18",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "debug_info" : "input.20",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "size_x" : 3,
      "top" : "input.20",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 0,
      "type" : "pool",
      "name" : "input.20",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.19",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.21",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 0,
      "top" : "input.22",
      "blob_weights" : 31,
      "K" : 32,
      "blob_biases" : 29,
      "name" : "input.21",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.20",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.23",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "residual.3",
      "blob_weights" : 35,
      "K" : 16,
      "blob_biases" : 33,
      "name" : "input.23",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.18",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.22,residual.3",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.24",
      "top" : "input.24",
      "type" : "elementwise",
      "name" : "input.24",
      "beta" : 0
    },
    {
      "bottom" : "input.24",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.25",
      "top" : "input.25",
      "type" : "activation",
      "name" : "input.25"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.26",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.26",
      "blob_weights" : 37,
      "K" : 32,
      "name" : "input.26",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "input.25",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "debug_info" : "input.27",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "size_x" : 3,
      "top" : "input.27",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 0,
      "type" : "pool",
      "name" : "input.27",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.26",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.28",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 0,
      "top" : "input.29",
      "blob_weights" : 41,
      "K" : 64,
      "blob_biases" : 39,
      "stride_x" : 2,
      "name" : "input.28",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.27",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.30",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "residual.4",
      "blob_weights" : 45,
      "K" : 32,
      "blob_biases" : 43,
      "stride_x" : 2,
      "name" : "input.30",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.25",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.29,residual.4",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.31",
      "top" : "input.31",
      "type" : "elementwise",
      "name" : "input.31",
      "beta" : 0
    },
    {
      "bottom" : "input.31",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.32",
      "top" : "input.32",
      "type" : "activation",
      "name" : "input.32"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.33",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.33",
      "blob_weights" : 47,
      "K" : 64,
      "name" : "input.33",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "input.32",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "debug_info" : "input.34",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "size_x" : 3,
      "top" : "input.34",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 0,
      "type" : "pool",
      "name" : "input.34",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.33",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.35",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 0,
      "top" : "input.36",
      "blob_weights" : 51,
      "K" : 128,
      "blob_biases" : 49,
      "name" : "input.35",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.34",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.32,input.36",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.37",
      "top" : "input.37",
      "type" : "elementwise",
      "name" : "input.37",
      "beta" : 0
    },
    {
      "bottom" : "input.37",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.38",
      "top" : "input.38",
      "type" : "activation",
      "name" : "input.38"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.39",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.39",
      "blob_weights" : 53,
      "K" : 64,
      "name" : "input.39",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "input.38",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "debug_info" : "input.40",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "size_x" : 3,
      "top" : "input.40",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 0,
      "type" : "pool",
      "name" : "input.40",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.39",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.41",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 0,
      "top" : "input.42",
      "blob_weights" : 57,
      "K" : 128,
      "blob_biases" : 55,
      "stride_x" : 2,
      "name" : "input.41",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.40",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.43",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "residual.5",
      "blob_weights" : 61,
      "K" : 64,
      "blob_biases" : 59,
      "stride_x" : 2,
      "name" : "input.43",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "input.38",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.42,residual.5",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.44",
      "top" : "input.44",
      "type" : "elementwise",
      "name" : "input.44",
      "beta" : 0
    },
    {
      "bottom" : "input.44",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.45",
      "top" : "input.45",
      "type" : "activation",
      "name" : "input.45"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.46",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.46",
      "blob_weights" : 63,
      "K" : 128,
      "name" : "input.46",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 256,
      "bottom" : "input.45",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "debug_info" : "input.47",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 1,
      "size_x" : 3,
      "top" : "input.47",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 0,
      "type" : "pool",
      "name" : "input.47",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.46",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.48",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 0,
      "top" : "input.49",
      "blob_weights" : 67,
      "K" : 256,
      "blob_biases" : 65,
      "name" : "input.48",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 4,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.47",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.50",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "residual",
      "blob_weights" : 71,
      "K" : 128,
      "blob_biases" : 69,
      "name" : "input.50",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "input.45",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.49,residual",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.51",
      "top" : "input.51",
      "type" : "elementwise",
      "name" : "input.51",
      "beta" : 0
    },
    {
      "bottom" : "input.51",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.52",
      "top" : "input.52",
      "type" : "activation",
      "name" : "input.52"
    },
    {
      "pad_r" : 0,
      "debug_info" : "x.8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 11,
      "is_global" : 1,
      "top" : "x.8",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "x.8",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.52",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "input.53",
      "weights" : {

      },
      "dst_w" : 256,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 2,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "x.8",
      "debug_info" : "input.53",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "input.53"
    },
    {
      "nB" : 256,
      "top" : "x",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 26,
      "blob_weights" : 75,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.53",
      "blob_biases" : 73,
      "has_tanh" : 0,
      "debug_info" : "x",
      "name" : "x",
      "has_prelu" : 0
    },
    {
      "bottom" : "x",
      "weights" : {

      },
      "nd_axis" : 1,
      "debug_info" : "348",
      "top" : "labelProbabilities",
      "type" : "softmax_nd",
      "name" : "348",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}